# Analyzing borrowers’ risk of defaulting

Your project is to prepare a report for a bank’s loan division. You’ll need to find out if a customer’s marital status and number of children has an impact on whether they will default on a loan. The bank already has some data on customers’ credit worthiness.

Your report will be considered when building the **credit score** of a potential customer. The **credit score** is used to evaluate the ability of a potential borrower to repay their loan.

# Covered in this project: <a id='back'></a>

1. Preprocessing the data
    * Missing values
    * Replace values when needed
    * Duplicate values
    * Data Categorization
    
2. Questions we asked to validate hypothesis:
    * - Is there a connection between having kids and repaying a loan on time?
    * Is there a connection between marital status and repaying a loan on time?
    * Is there a connection between income level and repaying a loan on time?
    * How do different loan purposes affect on-time loan repayment?

3. Conclusions



# Contents <a id='back'></a>
* [1. General Information of the data](#intro)
* [2. Data exploraton](#data_exploration)
    * [2.1. First impressions](#preprocessing_first)
    * [2.2. Intermediate conclusions](#preprocessing_intermediate)
    * [2.3. Data Preprocessing | Conclusions](#preprocessing_conclusions)
* [3. Data transformation](#data_transformation)
    * 3.1. Check the data the `education` column
    * 3.2. Check the data the `children` column
    * 3.3. Check the data the `days_employed` column
    * 3.4. Check the data the `dob_years` column
    * 3.5. Check the data the `family_status` column
    * 3.6. Check the data the `gender` column
    * 3.7. Check the data the `income_type` column
    * 3.8. Review `purpose` column
**Working with missing values:**
    * [3.9. Missing values in 'total_income'](#missing_values1)
    * [3.10. Missing values in 'days_employed'](#missing_values2)
    
* [4. Categorization of data](#data_categorization)
* [5. Checking Hypothesis](#hypothesis)
* [6. General conslusions](#general_conclusion)

## Open the data file and have a look at the general information. <a id='intro'></a>

[Back to top](#back)

In [1]:
# Loading all the libraries
import pandas as pd

In [2]:
# Load the data
data = pd.read_csv('/datasets/credit_scoring_eng.csv')

## Data exploration<a id='data_exploration'></a>

**Description of the data**
- `children` - the number of children in the family
- `days_employed` - work experience in days
- `dob_years` - client's age in years
- `education` - client's education
- `education_id` - education identifier
- `family_status` - marital status
- `family_status_id` - marital status identifier
- `gender` - gender of the client
- `income_type` - type of employment
- `debt` - was there any debt on loan repayment
- `total_income` - monthly income
- `purpose` - the purpose of obtaining a loan

In [3]:
# Let's see how many rows and columns our dataset has
data.shape

(21525, 12)

In [4]:
data.describe()

,children,days_employed,dob_years,education_id,family_status_id,debt,total_income
count,21525.000000,19351.000000,21525.000000,21525.000000,21525.000000,21525.000000,19351.000000
mean,0.538908,63046.497661,43.293380,0.817236,0.972544,0.080883,26787.568355
std,1.381587,140827.311974,12.574584,0.548138,1.420324,0.272661,16475.450632
min,-1.000000,-18388.949901,0.000000,0.000000,0.000000,0.000000,3306.762000
25%,0.000000,-2747.423625,33.000000,1.000000,0.000000,0.000000,16488.504500
50%,0.000000,-1203.369529,42.000000,1.000000,0.000000,0.000000,23202.870000
75%,1.000000,-291.095954,53.000000,1.000000,1.000000,0.000000,32549.611000
max,20.000000,401755.400475,75.000000,4.000000,4.000000,1.000000,362496.645000

In [5]:
# let's print the first N rows
#data.head(10)
data.sort_values('total_income', ascending=False).head(10)

,children,days_employed,dob_years,education,education_id,family_status,family_status_id,gender,income_type,debt,total_income,purpose
12412,0,-1477.438114,44,bachelor's degree,0,married,0,M,business,0,362496.645,housing renovation
19606,1,-2577.664662,39,bachelor's degree,0,married,0,M,business,1,352136.354,building a property
9169,1,-5248.554336,35,secondary education,1,civil partnership,1,M,employee,0,276204.162,supplementary education
20809,0,-4719.273476,61,secondary education,1,unmarried,4,F,employee,0,274402.943,purchase of the house for my family
17178,0,-5734.127087,42,bachelor's degree,0,civil partnership,1,M,business,0,273809.483,to have a wedding
17503,0,-2285.476482,43,secondary education,1,married,0,M,business,0,255618.158,real estate transactions
18368,1,-333.935516,41,BACHELOR'S DEGREE,0,civil partnership,1,M,business,0,248184.463,wedding ceremony
18353,1,-3173.282035,41,bachelor's degree,0,unmarried,4,F,business,0,228469.514,car
15268,1,-10207.448165,64,bachelor's degree,0,divorced,3,M,business,0,216039.297,housing
11071,1,-1851.200013,36,bachelor's degree,0,civil partnership,1,F,employee,0,205804.960,buy commercial real estate

### **First impressions:** <a id='preprocessing_first'></a>


**We can notice several things in our dataset:**

1. We have mixed absolute and minus values on `days_employed` that we will need to address
2. `education` column has same values with issues on the format
3. For each education degree we have an `education_id` that can help us categorize and group the information later on
4. For family status we also have a `family_status_id`, which means is also categorized in different groups

   

**Next steps:**
1. Get `info()` to have an overview of our data and understand what datatypes we have and total amount of values per column
2. Check for missing values & focus on the problematic columns

[Back to top](#back)

In [6]:
# Get info on data
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 21525 entries, 0 to 21524
Data columns (total 12 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   children          21525 non-null  int64
 1   days_employed     19351 non-null  float64
 2   dob_years         21525 non-null  int64
 3   education         21525 non-null  object
 4   education_id      21525 non-null  int64
 5   family_status     21525 non-null  object
 6   family_status_id  21525 non-null  int64
 7   gender            21525 non-null  object
 8   income_type       21525 non-null  object
 9   debt              21525 non-null  int64
 10  total_income      19351 non-null  float64
 11  purpose           21525 non-null  object
dtypes: float64(2), int64(5), object(5)
memory usage: 2.0+ MB

**Notes from the analyst:**

* At a first glance, we can see there are no issues with the columns names and they align with the documentation provided. We see the number of column values for `days_employed` & `total_income` is different than the rest, which means the data might contain missing values

In [7]:
# Let's look in the filtered table at the columns with missing data
data.isna().sum()

children               0
days_employed       2174
dob_years              0
education              0
education_id           0
family_status          0
family_status_id       0
gender                 0
income_type            0
debt                   0
total_income        2174
purpose                0
dtype: int64

**Notes from the analyst:**

* As we saw when checking the info() from our table, the values and missing values in `days_employed` and `total_income` are the same. We can think that those entries are related and we need to find out how. 

* We are going to check if the missing values in both columns are the same

* To prepare for next steps, we will check now if there are duplicated values and where are they placed, so we can compare later on when checking duplicated values in our dataset

In [8]:
# Let's apply multiple conditions for filtering data and look at the number of rows in the filtered table.
missing_values = data[(data.days_employed.isna())&(data.total_income.isna())]
len(missing_values)

2174

In [9]:
#duplicated values from the whole dataset
duplicated_values = data.duplicated().sum()
duplicated_values

54

In [10]:
#check if the duplicated values are within the missing values
missing_values_duplicated = missing_values.duplicated().sum()
missing_values_duplicated

54

### **Intermediate conclusion:** <a id='preprocessing_intermediate'></a>

* We discovered that there's missing values in both `days_employed` and `total_income` columns. So we checked if the values missing are the same in both columns and they are. 
* Before modifiying any columns or values, we also checked the duplicated values that will help us in later on checkings and we can conclude:
    * there are 54 duplicated values in the whole dataset, and the 54 duplicated values are within our missing values
    * We can say that before we process our data, in our missing values we have duplicated rows. This helps us to understand that:
        * we need to focus on cleaning the data on `days_employed` and `total_income` to be able to prove our hipothesis
        * if the number of duplicated values increases after transforming our data and/or change where are they placed, we can know from where they are coming from

**Next steps:**
* Calculate percentage of the missing values compared to the whole dataset
* Check if is related to specific client characteristic

[Back to top](#back)

In [11]:
#percent of missing values compare to the whole dataset
len(missing_values)/len(data)*100

10.099883855981417

**Notes from the analyst:**

* Calculating the % of missing values against the rest of the dataset gives us a better understandinf of the weight of the missing values. We can see is a low amount (10%) and exactly the same for both our columns `days_employed` and `total_income`

* We want now to check the missing values related to other client characteristics, to see if we can find a pattern that give us more information before deciding what to do with the missing values

In [12]:
# Let's investigate clients who do not have data on identified characteristic and the column with the missing values
#creating a filtered view with only the missing values and calculate them based on the 'income_type'

missing_values['income_type'].value_counts(normalize=True).map('{:.2%}'.format)

employee         50.83%
business         23.37%
retiree          19.00%
civil servant     6.76%
entrepreneur      0.05%
Name: income_type, dtype: object

* The missing values in `days_employed` & `total_income` are distributed in the `income_type` we show above. Meaning, Unemployed, maternity leave and student do not have any missing values, as we can see in the next table of the missing values from the whole dataset based on `the income_type`

In [13]:
#Checking distribution in our filtered missing values
#missing values from the whole dataset based on the income_type

data['income_type'].value_counts(normalize=True).map('{:.2%}'.format)

employee                       51.66%
business                       23.62%
retiree                        17.91%
civil servant                   6.78%
unemployed                      0.01%
entrepreneur                    0.01%
paternity / maternity leave     0.00%
student                         0.00%
Name: income_type, dtype: object

**Possible reasons for missing values in data**

* Because we understood in previous steps that the missing values in `total_income` matches the missing values in `days_employed`, when we look at the distribution of the missing values, we do not see a pattern that helps us identify a correlation between the missing values and any other characteristic.

* Looking at this, we might say that the missing values is due to a human error and we will decide later on with more information what and how are we gonna address them


### **Data Preprocessing | Conclusions** <a id='preprocessing_conclusions'></a>

* After exploring and preprocessing the data, we came to some first conclusions that will guide our next step, Data transformation:

    1. We have missing values in two columns `total_income` & `days_employed` which are the same values
    2. We have duplicated values in our dataset whithin our missing values
    3. We can't conclude there's a pattern for our missing values connected to any other client characteristic


**Next steps:**

* Before making the decision on how to deal with the missing values, we will process and adjust the data in our whole dataset, so when we will address missing values there won't be any accidental deletion of data that might affect our conclusions

[Back to top](#back)

## Data transformation <a id='data_transformation'></a>


**In this section:**   
* 3.1. Checked & fixed `education` column for spelling issues
* 3.2. Checked & fixed `children` column for issues on values
* 3.3. Checked & fixed `days_employed` column for issues on format values
* 3.4. Checked & fixed `dob_years` column for issues with values and categorization of ages by group
* 3.5. Checked & fixed `family_status` column
* 3.6. Checked & fixed `gender` column
* 3.7. Checked & fixed `income_type` column
* 3.8. Review `income_type` column

[Back to top](#back)

### Check the data the `education` column

**Notes from the analyst:**

* We have the same names in the column but with wrong formatting. We will apply lower function to set all values in lowercase and see if this is the reason for the duplicates
* We checked if the duplicated values in our dataset increases after fixing this column. From 54 to 71 duplicated values in our dataset

In [14]:
# Let's see all values in education column to check if and what spellings will need to be fixed
data['education'].sort_values().unique()

array(["BACHELOR'S DEGREE", "Bachelor's Degree", 'GRADUATE DEGREE',
       'Graduate Degree', 'PRIMARY EDUCATION', 'Primary Education',
       'SECONDARY EDUCATION', 'SOME COLLEGE', 'Secondary Education',
       'Some College', "bachelor's degree", 'graduate degree',
       'primary education', 'secondary education', 'some college'],
      dtype=object)

In [15]:
#convert all education values to lowercase and pass again unique()
data['education'] = data['education'].apply(str.lower)

In [16]:
# Fix the registers if required
data['education'].sort_values().unique()

array(["bachelor's degree", 'graduate degree', 'primary education',
       'secondary education', 'some college'], dtype=object)

In [17]:
#we follow our duplicated values after changes in the dataset
data.duplicated().sum()

71

### Check the data the `children` column

In [18]:
# Let's see the distribution of values in the `children` column
data['children'].value_counts(normalize=True).map('{:.2%}'.format)

 0     65.73%
 1     22.38%
 2      9.55%
 3      1.53%
 20     0.35%
-1      0.22%
 4      0.19%
 5      0.04%
Name: children, dtype: object


    
**Notes from the analyst & actions taken:**

* Checking at the number of children, we found 2 strange values (-1 and 20). While having -1 child is not possible, having 20 is also not much likely. 
* We will first change the values to absolute numbers, since we think -1 is an issue with the importing of the data
* 20 might be a typo, but we can't know for sure if they intended 2 or 0. 
    
* Since we are talking about a small amount of rows and percentage from the whole dataset for the value (20 children}), we will delete those rows

In [19]:
#convert to absolute numbers to work with the same dataset
data['children'] = data['children'].abs()
data['children'].value_counts()

0     14149
1      4865
2      2055
3       330
20       76
4        41
5         9
Name: children, dtype: int64

In [20]:
data['children'].value_counts(normalize=True).map('{:.2%}'.format)

0     65.73%
1     22.60%
2      9.55%
3      1.53%
20     0.35%
4      0.19%
5      0.04%
Name: children, dtype: object

In [21]:
# fix the data -- replace with the median
children_median = data.children.median()
data['children'] = data['children'].replace(20, children_median)

In [22]:
# Checking the `children` column again to make sure it's all fixed
data['children'].value_counts()

0.0    14225
1.0     4865
2.0     2055
3.0      330
4.0       41
5.0        9
Name: children, dtype: int64

### Check the data the `days_employed` column

**Notes from the analyst & actions taken:**

* We see mix of minus and absolute numbers. To be able to work with this data, we will change all `days_employed` to absolute numbers, since makes no sense to have minus days on this category.

In [23]:
# Find problematic data in `days_employed`, if they exist, and calculate the percentage
data['days_employed'].value_counts(dropna=False)

 NaN            2174
-1580.622577       1
-4122.460569       1
-2828.237691       1
-2636.090517       1
                ...
-7120.517564       1
-2146.884040       1
-881.454684        1
-794.666350        1
-3382.113891       1
Name: days_employed, Length: 19352, dtype: int64

In [24]:
# Address the problematic values, if they exist 
# convert to absolute numbers
data['days_employed'] = data['days_employed'].abs()

In [25]:
# Check the result - make sure it's fixed
data['days_employed'].value_counts(dropna=False)

NaN              2174
5849.845620         1
2539.534295         1
390574.985524       1
891.505415          1
                 ...
2325.720832         1
4086.407828         1
1259.497032         1
985.798488          1
1636.419775         1
Name: days_employed, Length: 19352, dtype: int64

### Check the data the `dob_years` column


**Notes from the analyst & actions taken:**

* We have 100 values with the age 0 (which less than 1% of our dataset), which is impossible considering the context we are talking about and that is age the value we are working with and might be a typo
* We will replace these values with the median of the whole dataset
* We will also group the ages and create a new column to preapre our data for later on calculations and easier data checking and comparison
    * Our lowest value is 19, so we will do our first grouping 19-29, since showing 0-9 & 10-19 is irrelevant grouping for our porpuses

In [26]:
# Check the `dob_years` for suspicious values and count the percentage
data['dob_years'].sort_values().unique()

array([ 0, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34,
       35, 36, 37, 38, 39, 40, 41, 42, 43, 44, 45, 46, 47, 48, 49, 50, 51,
       52, 53, 54, 55, 56, 57, 58, 59, 60, 61, 62, 63, 64, 65, 66, 67, 68,
       69, 70, 71, 72, 73, 74, 75])

In [27]:
data['dob_years'].value_counts()

35    617
40    609
41    607
34    603
38    598
42    597
33    581
39    573
31    560
36    555
44    547
29    545
30    540
48    538
37    537
50    514
43    513
32    510
49    508
28    503
45    497
27    493
56    487
52    484
47    480
54    479
46    475
58    461
57    460
53    459
51    448
59    444
55    443
26    408
60    377
25    357
61    355
62    352
63    269
64    265
24    264
23    254
65    194
66    183
22    183
67    167
21    111
0     101
68     99
69     85
70     65
71     58
20     51
72     33
19     14
73      8
74      6
75      1
Name: dob_years, dtype: int64

In [28]:
#remove rows with value 0 in 'dob_years'
median_dob_years = data.dob_years.median()
data['dob_years'] = data['dob_years'].replace(0.0, median_dob_years)

In [29]:
#check we removed 0 years
data['dob_years'].sort_values().unique()

array([19., 20., 21., 22., 23., 24., 25., 26., 27., 28., 29., 30., 31.,
       32., 33., 34., 35., 36., 37., 38., 39., 40., 41., 42., 43., 44.,
       45., 46., 47., 48., 49., 50., 51., 52., 53., 54., 55., 56., 57.,
       58., 59., 60., 61., 62., 63., 64., 65., 66., 67., 68., 69., 70.,
       71., 72., 73., 74., 75.])

In [30]:
# Address the issues in the `dob_years` column, if they exist

def assign_age_group(dob_years):
    
    if dob_years < 30:
        return '19-29'
    elif dob_years < 40:
        return '30-39'
    elif dob_years < 50:
        return '40-49'
    elif dob_years < 60:
        return '50-59'
    elif dob_years < 70:
        return '60-69'
    else:
        return '70+'
    
data['age_group'] = data['dob_years'].apply(assign_age_group)

In [31]:
# Check the result - make sure it's fixed
data['age_group'].sort_values().value_counts()

30-39    5674
40-49    5472
50-59    4679
19-29    3183
60-69    2346
70+       171
Name: age_group, dtype: int64

In [32]:
#fixing the values in the 'dob_years' column does affect the duplicated values from our dataset, we have now 72
data.duplicated().sum()

72

### Check the data the `family_status` column

**Notes from the analyst & actions taken:**

* We do not see any problematic values on the `family_status` that might affect our analysis
* We might consider divide widow and widower values but since we are not focusing on gender to check our hypothesis, we will keep it as it is

In [33]:
# Let's see the values for the column
data['family_status'].value_counts()

married              12380
civil partnership     4177
unmarried             2813
divorced              1195
widow / widower        960
Name: family_status, dtype: int64

### Check the data the `gender` column

**Notes from the analyst & actions taken:**

Since is only 1 value and we cannot find a pattern or a reason to assign one or other gender, we have 2 options:

1. Remove the row with this value
2. Consider this value as someone who did not want to inform about their gender. 
3. Keep it as it is because we are not going to prove our hypothesees based on gender

We decided to keep this row because it contains information on the other parameters that we will use to check our assumptions

In [34]:
# Let's see the values in the column
data['gender'].value_counts()

F      14236
M       7288
XNA        1
Name: gender, dtype: int64

In [35]:
#check for any patterns on the value 'XNA' from the 'gender' column to decide next steps
data[data['gender']=='XNA'].head()

,children,days_employed,dob_years,education,education_id,family_status,family_status_id,gender,income_type,debt,total_income,purpose,age_group
10701,0.0,2358.600502,24.0,some college,2,civil partnership,1,XNA,business,0,32624.825,buy real estate,19-29

### Check the data the `income_type` column

**Notes from the analyst & actions taken:**

We have only 1 value on 'paternity / maternity leave'. To simplify our data and make it more readable, actions taken:
* Change name of the value to only maternity leave, since the gender of this row is F

In [36]:
data['income_type'].sort_values().unique()

array(['business', 'civil servant', 'employee', 'entrepreneur',
       'paternity / maternity leave', 'retiree', 'student', 'unemployed'],
      dtype=object)

In [37]:
# Let's see the values in the column
data['income_type'].value_counts()

employee                       11119
business                        5085
retiree                         3856
civil servant                   1459
unemployed                         2
entrepreneur                       2
paternity / maternity leave        1
student                            1
Name: income_type, dtype: int64

In [38]:
data[data['income_type']=='paternity / maternity leave'].head()

,children,days_employed,dob_years,education,education_id,family_status,family_status_id,gender,income_type,debt,total_income,purpose,age_group
20845,2.0,3296.759962,39.0,secondary education,1,married,0,F,paternity / maternity leave,1,8612.661,car,30-39

In [39]:
# Address the problematic values, if they exist
data['income_type'] = data['income_type'].replace('paternity / maternity leave','maternity leave')

In [40]:
# Check the result - make sure it's fixed
data['income_type'].value_counts()

employee           11119
business            5085
retiree             3856
civil servant       1459
unemployed             2
entrepreneur           2
student                1
maternity leave        1
Name: income_type, dtype: int64

In [41]:
data.duplicated().sum()

72

### Review `purpose` column

* Reviewing the `purpose` column is also important to have a clean dataset. Aligning the categories here will help us later on. 
* Since we do not have a lot of unique values in `purpose`, we will categorize them in 3 big groups: "housing", "car", "education"
     * We created a new column to storage the 3 categories

* We believe than aligning the data in the `purpose` column now, will help us in in checking our hypothesis

In [42]:
data['purpose'].sort_values().unique()

array(['building a property', 'building a real estate',
       'buy commercial real estate', 'buy real estate',
       'buy residential real estate', 'buying a second-hand car',
       'buying my own car', 'buying property for renting out', 'car',
       'car purchase', 'cars', 'construction of own property',
       'education', 'getting an education', 'getting higher education',
       'going to university', 'having a wedding', 'housing',
       'housing renovation', 'housing transactions', 'profile education',
       'property', 'purchase of a car', 'purchase of my own house',
       'purchase of the house', 'purchase of the house for my family',
       'real estate transactions', 'second-hand car purchase',
       'supplementary education', 'to become educated', 'to buy a car',
       'to get a supplementary education', 'to have a wedding',
       'to own a car', 'transactions with commercial real estate',
       'transactions with my real estate', 'university education',
       'wedding ceremony'], dtype=object)

In [43]:
def credit_category (purpose):
    if 'hous' in purpose or 'estate' in purpose or 'propert' in purpose:
        return 'housing'
    elif 'wedd' in purpose:
        return 'wedding'
    elif 'car' in purpose:
        return 'car'
    elif 'educat' or 'uni' in purpose:
        return 'education'
    else:
        return 'other'

data['purpose_category'] = data['purpose'].apply(credit_category)

print(data['purpose_category'].unique())

['housing' 'car' 'education' 'wedding']

In [44]:
#check the function was applied correctly to our 'purpose' column
data.head()

,children,days_employed,dob_years,education,education_id,family_status,family_status_id,gender,income_type,debt,total_income,purpose,age_group,purpose_category
0,1.0,8437.673028,42.0,bachelor's degree,0,married,0,F,employee,0,40620.102,purchase of the house,40-49,housing
1,1.0,4024.803754,36.0,secondary education,1,married,0,F,employee,0,17932.802,car purchase,30-39,car
2,0.0,5623.422610,33.0,secondary education,1,married,0,M,employee,0,23341.752,purchase of the house,30-39,housing
3,3.0,4124.747207,32.0,secondary education,1,married,0,M,employee,0,42820.568,supplementary education,30-39,education
4,0.0,340266.072047,53.0,secondary education,1,civil partnership,1,F,retiree,0,25378.572,to have a wedding,50-59,wedding

### Check for duplicates

**Notes from the analyst & actions taken:**

1. We checked the duplicated values for our whole dataset in the beggining of the data preprocessing and found 54 values included in `days_employed` and `total_income` (our columns with missing values)
2. We will check for duplicated values after we transformed and cleaned up our data
3. We have now 72 missing values (since we fixed the wrong naming format in `education` and the values in `children`

* Knowing that our duplicates coming from the missing values, we won't drop our duplicates until we fill the missing values accoring to several parameters
* If we ignore the columns with NaN values, we see we do not have duplicated values.

In [45]:
data_mis_values = data[(data['days_employed'].isna())&(data['total_income'].isna())]
data_mis_values.dropna(subset=('days_employed','total_income')).duplicated().sum()

0

In [46]:
dup_no_missing_values= data.dropna(subset=('days_employed','total_income')).duplicated().sum()
dup_no_missing_values

0

In [47]:
data.duplicated().sum()

72

In [48]:
data.drop_duplicates().sum()

children                                                      10158.0
days_employed                                        1294866919.07592
dob_years                                                    932541.0
education           bachelor's degreesecondary educationsecondary ...
education_id                                                    17529
family_status       marriedmarriedmarriedmarriedcivil partnershipc...
family_status_id                                                20893
gender              FFMMFMFMFMMFMFFFFMFFMFFMFMMMFFFFFFFMMFMFMFFFFF...
income_type         employeeemployeeemployeeemployeeretireebusines...
debt                                                             1741
total_income                                            518366235.231
purpose             purchase of the housecar purchasepurchase of t...
age_group           40-4930-3930-3930-3950-5919-2940-4950-5930-394...
purpose_category    housingcarhousingeducationweddinghousinghousin...
dtype: object

In [49]:
data.duplicated().sum()

72

# Working with missing values

* The columns with missing values are `total_income` and `days_employed`.
* In the next two points we will address them separately

In [50]:
data.isna().sum()

children               0
days_employed       2174
dob_years              0
education              0
education_id           0
family_status          0
family_status_id       0
gender                 0
income_type            0
debt                   0
total_income        2174
purpose                0
age_group              0
purpose_category       0
dtype: int64

### Restoring missing values in `total_income` <a id='missing_values1'></a>

* We first check the median and mean of the total income by different categories to see the distribution and what will be the decision we will make

[Back to top](#back)

In [51]:
# We access the new age_group column with the groups of the age column
# Checking how is the distribution of the values in the new column
data['age_group'].value_counts(normalize=True).map('{:.2%}'.format)

30-39    26.36%
40-49    25.42%
50-59    21.74%
19-29    14.79%
60-69    10.90%
70+       0.79%
Name: age_group, dtype: object

In [52]:
# Create a table without missing values and print a few of its rows to make sure it looks fine
no_mis_values = data.dropna()
no_mis_values.head(10)

,children,days_employed,dob_years,education,education_id,family_status,family_status_id,gender,income_type,debt,total_income,purpose,age_group,purpose_category
0,1.0,8437.673028,42.0,bachelor's degree,0,married,0,F,employee,0,40620.102,purchase of the house,40-49,housing
1,1.0,4024.803754,36.0,secondary education,1,married,0,F,employee,0,17932.802,car purchase,30-39,car
2,0.0,5623.422610,33.0,secondary education,1,married,0,M,employee,0,23341.752,purchase of the house,30-39,housing
3,3.0,4124.747207,32.0,secondary education,1,married,0,M,employee,0,42820.568,supplementary education,30-39,education
4,0.0,340266.072047,53.0,secondary education,1,civil partnership,1,F,retiree,0,25378.572,to have a wedding,50-59,wedding
5,0.0,926.185831,27.0,bachelor's degree,0,civil partnership,1,M,business,0,40922.170,purchase of the house,19-29,housing
6,0.0,2879.202052,43.0,bachelor's degree,0,married,0,F,business,0,38484.156,housing transactions,40-49,housing
7,0.0,152.779569,50.0,secondary education,1,married,0,M,employee,0,21731.829,education,50-59,education
8,2.0,6929.865299,35.0,bachelor's degree,0,civil partnership,1,F,employee,0,15337.093,having a wedding,30-39,wedding
9,0.0,2188.756445,41.0,secondary education,1,married,0,M,employee,0,23108.150,purchase of the house for my family,40-49,housing

In [53]:
#confirming there are no missing values in our dataFrame
no_mis_values.isna().sum()

children            0
days_employed       0
dob_years           0
education           0
education_id        0
family_status       0
family_status_id    0
gender              0
income_type         0
debt                0
total_income        0
purpose             0
age_group           0
purpose_category    0
dtype: int64

In [54]:
# Distribution of `total_income` means & medians based on income_type
grouped_income_type = no_mis_values.groupby('income_type').agg({'total_income':['mean','median']})
grouped_income_type

                 total_income
                         mean      median
income_type
business         32386.793835  27577.2720
civil servant    27343.729582  24071.6695
employee         25820.841683  22815.1035
entrepreneur     79866.103000  79866.1030
maternity leave   8612.661000   8612.6610
retiree          21940.394503  18962.3180
student          15712.260000  15712.2600
unemployed       21014.360500  21014.3605

In [55]:
# Distribution of `total_income` means & medians based on education
grouped_education = no_mis_values.groupby('education').agg({'total_income':['mean','median']})
grouped_education

                     total_income
                             mean      median
education
bachelor's degree    33142.802434  28054.5310
graduate degree      27960.024667  25161.5835
primary education    21144.882211  18741.9760
secondary education  24594.503037  21836.5830
some college         29045.443644  25618.4640

In [56]:
# Distribution of `total_income` means & medians based on family_status

grouped_family_status =no_mis_values.groupby('family_status').agg({'total_income':['mean','median']})
grouped_family_status

                   total_income
                           mean     median
family_status
civil partnership  26694.428597  23186.534
divorced           27189.354550  23515.096
married            27041.784689  23389.540
unmarried          26934.069805  23149.028
widow / widower    22984.208556  20514.190

In [57]:
# Distribution of `total_income` means & medians based on children

grouped_children =no_mis_values.groupby('children').agg({'total_income':['mean','median']})
grouped_children

          total_income
                  mean      median
children
0.0       26425.408929  23032.5720
1.0       27368.627863  23660.5630
2.0       27496.357898  23143.7700
3.0       29322.623993  25155.4480
4.0       27289.829647  24981.6340
5.0       27268.847250  29816.2255

**Notes from the analyst & actions taken:**

* We checked other factors, like education, family status or number of children to see if the relation with the total income to calculate median and mean and decide how to fill our missing values
* We realized we can not choose only one category to fill the missing values, so we will create a dictionary that will give us the median of the total_income by 3 categories: income_type, education and age
    * We calculated the median and mean combining these 3 categories and replacing the missing values in total_income with the median values we got

In [58]:
no_mis_values_grouped = no_mis_values.groupby(['education','income_type','age_group']).agg({'total_income':['mean','median']})
no_mis_values_grouped

                                         total_income
                                                 mean      median
education         income_type age_group
bachelor's degree business    19-29      32256.239769  28250.2840
                              30-39      39169.886242  32574.9760
                              40-49      41067.908317  34604.4780
                              50-59      42774.930702  35379.3990
                              60-69      40074.643420  30849.5425
...                                               ...         ...
some college      employee    60-69      33851.476167  32844.1030
                  retiree     40-49      13485.433000   8199.5900
                              50-59      19487.096600  17973.6230
                              60-69      28573.649214  25908.0145
                              70+        13917.989667  14479.1930

[92 rows x 2 columns]

In [59]:
# Filling in missing values in total_income
data['total_income'] = data['total_income'].fillna(data.groupby(['education','income_type','age_group'])['total_income'].transform('median'))

In [60]:
# Check if it works
data.isna().sum()

children               0
days_employed       2174
dob_years              0
education              0
education_id           0
family_status          0
family_status_id       0
gender                 0
income_type            0
debt                   0
total_income           3
purpose                0
age_group              0
purpose_category       0
dtype: int64

**Notes from the analyst & actions taken:**

* We replaced the missing values in our dataset taking in consideration the education, the income_type and the age_group to get the most accurate median depending on the characteristics of our client
* Once we replaced the missing values, we still have 3 values that did not get replaced because is not represented in our grouping

We print those 3 values and we get:

In [61]:
data[data['total_income'].isna()]

,children,days_employed,dob_years,education,education_id,family_status,family_status_id,gender,income_type,debt,total_income,purpose,age_group,purpose_category
1303,1.0,NaN,70.0,primary education,3,civil partnership,1,F,employee,0,NaN,transactions with commercial real estate,70+,housing
5936,0.0,NaN,58.0,bachelor's degree,0,married,0,M,entrepreneur,0,NaN,buy residential real estate,50-59,housing
8142,0.0,NaN,64.0,primary education,3,civil partnership,1,F,civil servant,0,NaN,to have a wedding,60-69,wedding

In [62]:
#check if we can get medians based on the 'income_type' and 'education' and use these parameters 
#to fill the 3 missing values
data.groupby(['dob_years','education']).agg({'total_income':'median'})

                               total_income
dob_years education
19.0      secondary education    16588.2370
          some college           14575.7170
20.0      bachelor's degree      14251.5510
          secondary education    20910.9260
          some college           13879.4295
...                                     ...
73.0      primary education      16026.6600
          secondary education    19070.4780
74.0      bachelor's degree      21589.6570
          secondary education     8760.7590
75.0      secondary education    24525.2240

[222 rows x 1 columns]

In [63]:
data['total_income'] = data['total_income'].fillna(data.groupby(['dob_years','education'])['total_income'].transform('median'))

In [64]:
data.isna().sum()

children               0
days_employed       2174
dob_years              0
education              0
education_id           0
family_status          0
family_status_id       0
gender                 0
income_type            0
debt                   0
total_income           0
purpose                0
age_group              0
purpose_category       0
dtype: int64

**Notes from the analyst & actions taken:**

* We decided to replace the missing values of these 3 ones based on the 'dob_years' and the 'education' to have a more accurate number to fill with

In [65]:
# Checking the number of entries in the columns
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 21525 entries, 0 to 21524
Data columns (total 14 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   children          21525 non-null  float64
 1   days_employed     19351 non-null  float64
 2   dob_years         21525 non-null  float64
 3   education         21525 non-null  object
 4   education_id      21525 non-null  int64
 5   family_status     21525 non-null  object
 6   family_status_id  21525 non-null  int64
 7   gender            21525 non-null  object
 8   income_type       21525 non-null  object
 9   debt              21525 non-null  int64
 10  total_income      21525 non-null  float64
 11  purpose           21525 non-null  object
 12  age_group         21525 non-null  object
 13  purpose_category  21525 non-null  object
dtypes: float64(4), int64(3), object(7)
memory usage: 2.3+ MB

###  Restoring values in `days_employed` <a id='missing_values2'></a>

* We decided not to fill the missing values in days_employed because we won't use this column to prove any of our hypotheses

[Back to top](#back)

In [66]:
# Check if it works
data.isna().sum()

children               0
days_employed       2174
dob_years              0
education              0
education_id           0
family_status          0
family_status_id       0
gender                 0
income_type            0
debt                   0
total_income           0
purpose                0
age_group              0
purpose_category       0
dtype: int64

# Dealing with Duplicates
**Notes from the analyst & actions taken:**

* After filling the missing values in total_income, we check the duplicates and see we have the same amount as before, meaning filling the missing values is not affecting this number

In [67]:
data.duplicated().sum()

72

In [68]:
data = data.drop_duplicates().reset_index(drop=True)

In [69]:
data.duplicated().sum()

0

## Categorization of data

 * We decided to categorize our data on:
     * Children
     * Family Status: "Single Household" / "With Partner"
     * Total income range: Low, Middle, Upper
     * Purpose category we already created that function in our data transforamtion part

In [70]:
# Print the values for your selected data for categorization
data['children'].value_counts()

0.0    14166
1.0     4855
2.0     2052
3.0      330
4.0       41
5.0        9
Name: children, dtype: int64

In [71]:
data['family_status'].value_counts()

married              12339
civil partnership     4150
unmarried             2810
divorced              1195
widow / widower        959
Name: family_status, dtype: int64

In [72]:
data['debt'].value_counts()

0    19712
1     1741
Name: debt, dtype: int64

To categorize our data about the total_income, we will use 4 different ranges:

* **Low income** - if total income per month is lower or equal than 17000
* **Low-midel income** - if total income per month is between 17000 and 22000
* **Upper-midel income** - if total income per month is between 22000 and 31000
* **Upper income** - it total income per month is higher than 30000.


Those classification were chosen by the values of min, 25% value, 50% value, 75% value and max value.

In [73]:
data['total_income'].value_counts()

22192.7345    254
22088.2215    246
18834.8165    148
17943.5555    146
20189.5580    129
             ...
40299.3820      1
10000.3920      1
99284.6960      1
6264.5320       1
41428.9160      1
Name: total_income, Length: 19390, dtype: int64

In [74]:
# We have too many total_income values, so we will categorize them based on the American Salary grouping

def income_level(total_income): 
    if total_income<= 17000:
        return 'Low income'
    elif 17000< total_income <= 22000:
        return 'Low-midel income'
    elif 22000< total_income <= 31000:
        return 'Upper-midel income'
    else:
        return 'Upper income'

In [75]:
data['income_level'] = data['total_income'].apply(income_level)

In [76]:
# Create a column with the categories and count the values for them
data['income_level'].sort_values().value_counts()

Upper-midel income    6286
Upper income          5658
Low income            5226
Low-midel income      4283
Name: income_level, dtype: int64

In [77]:
#categorize the data based on Single household or partner (meaning 2 income)
def family_category (family_status):
    if 'married' in family_status or 'civil_partnership' in family_status:
        return 'With Partner'
    else:
        return 'Single'

data['family_category'] = data['family_status'].apply(family_category)

In [78]:
data['family_category'].value_counts()

With Partner    15149
Single           6304
Name: family_category, dtype: int64

## Checking the Hypotheses

        * debt =  whether the customer has ever defaulted on a loan. 1 = yes / 0 = no
We are answering these questions:
* Is there a connection between having kids and repaying a loan on time?
* Is there a connection between marital status and repaying a loan on time?
* Is there a connection between income level and repaying a loan on time?
* How do different loan purposes affect on-time loan repayment?

**Is there a correlation between having children and paying back on time?**

In [79]:
# Check the children data and paying back on time
kids = pd.DataFrame(data.groupby('debt')['children'].value_counts())
kids

               children
debt children
0    0.0          13095
     1.0           4410
     2.0           1858
     3.0            303
     4.0             37
     5.0              9
1    0.0           1071
     1.0            445
     2.0            194
     3.0             27
     4.0              4

In [80]:
# Calculating default-rate based on the number of children
data.groupby(['children'])['debt'].mean().map('{:.2%}'.format)

children
0.0    7.56%
1.0    9.17%
2.0    9.45%
3.0    8.18%
4.0    9.76%
5.0    0.00%
Name: debt, dtype: object

**Conclusion**

* Peple with more children succeeded to pay their loans more than people with children
* We want to understand why and if is connected to other parameters

**Is there a correlation between family status and paying back on time?**

In [81]:
# Check the family status data and paying back on time

family = pd.DataFrame(data.groupby('debt')['family_category'].value_counts())
family

# Calculating default-rate based on family status

                      family_category
debt family_category
0    With Partner               13944
     Single                      5768
1    With Partner                1205
     Single                       536

In [82]:
# perceantage of paied loans by family_status
data.groupby(['family_status'])['debt'].mean().map('{:.2%}'.format)

family_status
civil partnership    9.35%
divorced             7.11%
married              7.55%
unmarried            9.75%
widow / widower      6.57%
Name: debt, dtype: object

**Conclusion**

* Single people can pay easily the loans, but there's not a big difference from people with partners
* But if we check the % of debt payed by family_status, we can see that unmarried are the ones who succeed the most in paying the debt.
    * We will need to understand what are the characteristics of the family_status that help to pay the debt or not pay

**Is there a correlation between income level and paying back on time?**

In [83]:
# Check the income level data and paying back on time
income_level = pd.DataFrame(data.groupby('debt')['income_level'].value_counts())
income_level

                         income_level
debt income_level
0    Upper-midel income          5737
     Upper income                5255
     Low income                  4816
     Low-midel income            3904
1    Upper-midel income           549
     Low income                   410
     Upper income                 403
     Low-midel income             379

In [84]:
data.groupby(['income_level'])['debt'].mean().map('{:.2%}'.format)

income_level
Low income            7.85%
Low-midel income      8.85%
Upper income          7.12%
Upper-midel income    8.73%
Name: debt, dtype: object

**Conclusion**

* People with lower income are able to pay more than people with upper income

**How does credit purpose affect the default rate?**

In [85]:
credit_purpose = pd.DataFrame(data.groupby('debt')['purpose_category'].value_counts())
credit_purpose

                       purpose_category
debt purpose_category
0    housing                      10029
     car                           3903
     education                     3643
     wedding                       2137
1    housing                        782
     car                            403
     education                      370
     wedding                        186

In [86]:
# Check the percentages for default rate for each credit purpose and analyze them
data.groupby(['purpose_category'])['debt'].mean().map('{:.2%}'.format)

purpose_category
car          9.36%
education    9.22%
housing      7.23%
wedding      8.01%
Name: debt, dtype: object

**Conclusion**

* As expected, paying loan for housing purposes is harder since usually are bigger amounts of money to ask

## General Conclusion 

With the given data we studied the risk of a set of people to pay back or not a loan. Based on several hipothesis and questions we asked ourselves to help us guide this project and conclusions. 
As a recap, we ask ourselves:

   * Is there a connection between having kids and repaying a loan on time?
   * Is there a connection between marital status and repaying a loan on time?
   * Is there a connection between income level and repaying a loan on time?
   * How do different loan purposes affect on-time loan repayment?
    
    
The data provided contained some issues we had to address as of missing and duplicated values. We also cleaned up our data to make it more readable for our stakeholders and simplify it (like the categorization of total_income in ranges, or the purpose of asking for a loan)

We then got to some conclusions:

**Children factor:**
* People with children have more dificulties paying their loans, as expected, since there are more expenses in the household. Up to 40% of them did not repay their loan
* Having no children is a factor that helps people repay their loan, as their expenses are likley lower

**Income factor:**
* People with higher incomes (more than 17000) have less difficulties paying their loans back

**Purpose factor:**
* Paying back loans for long-term purposes is easier, like housing. 

**Partnership factor:**
* Asking for a loan and paying it back when single is harder than with a partner, as two incomes get in the household

For the Bank, we can conclude that the number of children is a factor to consider when offering a loan but cannot be addressed as unique reason, as the range of the total income of the person plays a strong role as well.